In [1]:
import pandas as pd

In [18]:
#data sets

data1={"Id":["S01","S02","S03","S04","S05","S06"],
       "Student":["Mukund","Sachin","Rajesh","Girish","Mohan","Amit"],
       "Roll_No":[101,102,103,104,105,106]
      }
data2={
    "Id":["S07","S08","S09","S10"],
    "Student":["Anita","Pooja","Karishma","Aishwarya"],
    "Roll_No":[107,108,109,110]
}

In [23]:
df1=pd.DataFrame(data1,index=[0,1,2,3,4,5])
df1

    Id Student  Roll_No
0  S01  Mukund      101
1  S02  Sachin      102
2  S03  Rajesh      103
3  S04  Girish      104
4  S05   Mohan      105
5  S06    Amit      106

In [25]:
df2=pd.DataFrame(data2,index=[6,7,8,9])
df2

    Id    Student  Roll_No
6  S07      Anita      107
7  S08      Pooja      108
8  S09   Karishma      109
9  S10  Aishwarya      110

In [26]:
df3=pd.concat([df1,df2])

In [27]:
df3

    Id    Student  Roll_No
0  S01     Mukund      101
1  S02     Sachin      102
2  S03     Rajesh      103
3  S04     Girish      104
4  S05      Mohan      105
5  S06       Amit      106
6  S07      Anita      107
7  S08      Pooja      108
8  S09   Karishma      109
9  S10  Aishwarya      110

In [31]:
df3.loc[0]

Id            S01
Student    Mukund
Roll_No       101
Name: 0, dtype: object

In [32]:
df3.loc[1]

Id            S02
Student    Sachin
Roll_No       102
Name: 1, dtype: object

In [38]:
df3.iloc[[0,1]]["Student"]

0    Mukund
1    Sachin
Name: Student, dtype: object

In [39]:
df3["Student"]

0       Mukund
1       Sachin
2       Rajesh
3       Girish
4        Mohan
5         Amit
6        Anita
7        Pooja
8     Karishma
9    Aishwarya
Name: Student, dtype: object

In [40]:
df3["Roll_No"]

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: Roll_No, dtype: int64